## Numbeo Extract - city_prices

To extract from the API of NUmbeo follow the next steps:
- Access the url prefix with a request method e.g. `https://www.numbeo.com:8008/api/<DOCUMENT>?api_key=<YOUR_KEY>`
- Every document (table) in Numbeo has different parameters to query, for more info go to [API doc](https://www.numbeo.com/api/doc.jsp)

In [1]:
import pandas as pd
import requests
import json
from pandas.io.json import json_normalize

In [11]:
request= requests.get("http://www.numbeo.com:8008/api/city_prices?api_key=")

In [12]:
json_parse = json.loads(request.text)
request.text

'{"error":"Couldn\'t resolve city in your request."}\n'

In [13]:
request= requests.get("http://www.numbeo.com:8008/api/city_prices?api_key=&query=Belgrade")

In [1]:
#request.text

In [17]:
df= json_normalize(json.loads(request.text)['prices'])
df.head()

,average_price,data_points,highest_price,item_id,item_name,lowest_price
0,600.0,42,826.993048,1,"Meal, Inexpensive Restaurant, Restaurants",500.0
1,3000.0,39,3500.000000,2,"Meal for 2 People, Mid-range Restaurant, Three...",2000.0
2,500.0,39,600.000000,3,McMeal at McDonalds (or Equivalent Combo Meal)...,470.0
3,180.0,44,220.000000,4,"Domestic Beer (0.5 liter draught), Restaurants",150.0
4,220.0,41,270.000000,5,"Imported Beer (0.33 liter bottle), Restaurants",180.0

In [9]:
df= json_normalize(json.loads(request.text))
df

,city_id,contributors,currency,monthLastUpdate,name,prices,yearLastUpdate
0,6189,338,RSD,5,"Belgrade, Serbia","[{'item_name': 'Meal, Inexpensive Restaurant, ...",2018